app/controllers/articles_controller.rb

SELECT  "articles".* FROM "articles" LIMIT ? OFFSET ?  [["LIMIT", 5], ["OFFSET", 0]]
SELECT COUNT(*) FROM "articles"
---
    def index
        #DUDAS
        @articles = Article.paginate(page: params[:page], per_page: 5)

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
INSERT INTO "articles" ("title", "description", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["title", "This is an article with user"], ["description", "Article with a user"], ["created_at", 2017-04-27 16:56:45 UTC], ["updated_at", 2017-04-27 16:56:45 UTC], ["user_id", 2]]
---
    def create

        @article = Article.new(article_params)
        @article.user = User.first
        if @article.save

UPDATE "articles" SET "title" = ?, "description" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["title", "Article 9"], ["description", "Decription article 9"], ["updated_at", 2017-04-04 16:35:23 UTC], ["id", 9]]
---
    def update
        if @article.update(article_params)