app/controllers/categories_controller.rb

SELECT  "categories".* FROM "categories" LIMIT ? OFFSET ?  [["LIMIT", 5], ["OFFSET", 0]]
SELECT COUNT(*) FROM "categories"
---
    def index
        @categories = Category.paginate(page: params[:page], per_page: 5)

SELECT  "categories".* FROM "categories" WHERE "categories"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
UPDATE "categories" SET "name" = ?, "updated_at" = ? WHERE "categories"."id" = ?  [["name", "Artes"], ["updated_at", 2017-05-29 17:41:10 UTC], ["id", 5]]
---
    def update
        @category = Category.find(params[:id])
        if @category.update(category_params)

SELECT  "categories".* FROM "categories" WHERE "categories"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "articles".* FROM "articles" INNER JOIN "article_categories" ON "articles"."id" = "article_categories"."article_id" WHERE "article_categories"."category_id" = ? LIMIT ? OFFSET ?  [["category_id", 1], ["LIMIT", 5], ["OFFSET", 0]]
SELECT "categories".* FROM "categories"
SELECT COUNT(*) FROM "articles" INNER JOIN "article_categories" ON "articles"."id" = "article_categories"."article_id" WHERE "article_categories"."category_id" = ?  [["category_id", 1]]
---
    def show
        @category = Category.find(params[:id])
        @category_articles = @category.articles.paginate(page: params[:page], per_page: 5)