app/controllers/sessions_controller.rb

        def create
            #Dudas
            user =User.find_by(email: params[:session][:email].downcase)
---
SELECT  "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", ""], ["LIMIT", 1]]