app/controllers/users_controller.rb

    def index
    #DUDAS
    @users = User.paginate(page: params[:page], per_page: 5)
---
SELECT  "users".* FROM "users" LIMIT ? OFFSET ?  [["LIMIT", 5], ["OFFSET", 0]]
SELECT COUNT(*) FROM "users"

    def create
        @user = User.new(user_params)
        if @user.save
---
INSERT INTO "users" ("username", "email", "created_at", "updated_at", "password_digest") VALUES (?, ?, ?, ?, ?)

    def update
        if @user.update(user_params)
---
UPDATE "users" SET "password_digest" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["password_digest", "$2a$10$NTwllyc9DkEmZ1dn4k62d.X9xBSw/fP2VUfffsOdfNcSh7QeXeksC"], ["updated_at", 2017-05-08 18:46:37 UTC], ["id", 3]]

    def show
        @user_articles = @user.articles.paginate(page: params[:page], per_page: 5)
---
SELECT  "articles".* FROM "articles" WHERE "articles"."user_id" = ? LIMIT ? OFFSET ?  [["user_id", 2], ["LIMIT", 5], ["OFFSET", 0]]
SELECT COUNT(*) FROM "articles" WHERE "articles"."user_id" = ?  [["user_id", 2]]