app/views/layouts/_navigation.html.erb

SELECT "categories".* FROM "categories"
---
                  <li><%= link_to "All Categories", categories_path %></li>
                  <% Category.all.each do |category| %>

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
        <% if logged_in? %>
          <% user = User.find(session[:user_id])if (session[:user_id])%>